# -*- coding: utf-8 -*-

class ListFile:
    '''意图识别中所遇到的数组参数'''
    person_list = ['吾','它','咱','其','他','公','侬','自身','卿','自个儿',
        '客','恁','君','而','人家','伊','身','它们','自我','彼','异',
        '外','己','您','我','渠','小我','俺','予','尔','斯人','你',
        '咱家','自','汝','她','自家','自各儿','个人','余','本身',
        '自己','本人','若','乃','我们','你们','他们','它们','她们','这个',
        '那','那个','这','此','其','该']

    mood_list = ['吧','罢','呗','啵','的','价','家','啦','来','唻','了',
        '嘞','哩','咧','咯','啰','喽','嘛','嚜','呐','否','呵','哈',
        '不','兮','般','则','连','罗','给','噻','哉','阿','啊','呃',
        '欸','哇','呀','也','耶','哟','欤','呕','噢','呦','嘢','哦']

    ask_list = ['接头','摸底','晓得','探听','打问','冷暖自知，心明如镜','喻',
        '察察为明','略知一二','宽解','探询','知','了解','清楚','明亮',
        '垂询','辩明','详','知底','领略','探问','掌握','未卜先知','时有所闻',
        '解','了然','了了','知晓','透亮','亮堂','打探','明白','晓','问询',
        '敞亮','领悟','懂','询问','打听','懂得','叩问','知道','亮','知情',
        '明了','明','刺探','分晓','理解']

    number_terms = ['一','壹','二','贰','三','叁','四','肆','五','伍','六',
        '陆','七','柒','八','捌','九','玖','十','拾','零','〇']
